#include <Servo.h>

Servo myServo;  // إنشاء كائن سيرفو

int pos = 0;    // المتغير لتخزين زاوية السيرفو

void setup() {
  myServo.attach(9);  // ربط السيرفو إلى المنفذ الرقمي 9
}

void loop() {
  // التدوير من 0 إلى 180 درجة
  for (pos = 0; pos <= 180; pos += 1) {
    myServo.write(pos);  // ضبط السيرفو على الموضع الحالي
    delay(15);           // الانتظار قليلاً لإتاحة الوقت للسيرفو للتحرك
  }
  // التدوير من 180 إلى 0 درجة
  for (pos = 180; pos >= 0; pos -= 1) {
    myServo.write(pos);  // ضبط السيرفو على الموضع الحالي
    delay(15);           // الانتظار قليلاً لإتاحة الوقت للسيرفو للتحرك
  }
}
